num_dict = {
1: "один",
2: "два",
3: "три",
4: "четыре",
5: "пять",
6: "шесть",
7: "семь",
8: "восемь",
9: "девять",
10: "десять",
11: "одиннадцать",
12: "двенадцать",
13: "тринадцать",
14: "четырнадцать",
15: "пятнадцать",
16: "шестнадцать",
17: "семнадцать",
18: "восемнадцать",
19: "девятнадцать",
20: "двадцать",
30: "тридцать",
40: "сорок",
50: "пятьдесят",
60: "шестьдесят",
70: "семьдесят",
80: "восемьдесят",
90: "девяносто",
100: "сто",
200: "двести",
300: "триста",
400: "четыреста",
500: "пятьсот",
600: "шестьсот",
700: "семьсот",
800: "восемьсот",
900: "девятьсот",
1000: "тысяча"
}

def num_to_text(num):
    if num in num_dict:
        return num_dict[num]
    elif num < 100:
        tens = num // 10 * 10
        ones = num % 10
        return num_dict[tens] + " " + num_dict[ones]
    else:
        hundreds = num // 100 * 100
        tens_ones = num % 100
        return num_dict[hundreds] + " " + num_to_text(tens_ones)


number = int(input("Enter num from 1 to 1000: "))


if number < 1 or number > 1000:
    print("OUT OF RANGE!!!")
else:
    print(num_to_text(number))
